# CodeCheckingStatus Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..CodeCheckingStatus Property
StructuralConnectionHandler Class See Also
---
Code checking status of the structural connection.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public StructuralConnectionCodeCheckingStatus CodeCheckingStatus { get; set; }
```

Visual Basic
---
```text
Public Property CodeCheckingStatus As StructuralConnectionCodeCheckingStatus
	Get
	Set
```

Visual C++
---
```text
public:
property StructuralConnectionCodeCheckingStatus CodeCheckingStatus {
	StructuralConnectionCodeCheckingStatus get ();
	void set (StructuralConnectionCodeCheckingStatus value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace